<template>
  <div id="app">
    <h3>Задание № 1</h3>
    <p>Создайте компонент "Аутентификация" (Authentication),
      который будет отображать форму входа или сообщение об
      успешной аутентификации в зависимости от переданного
      пропса isAuthenticated. Используйте директиву v-if для
      условного отображения разных элементов в шаблоне
      компонента.</p>
    <SeminarTask1Component />

    <h3>Задание № 2</h3>
    <p>Разработать интерфейс корзины товаров, в котором пользователь
      может изменять количество товаров в корзине и видеть общую сумму
      покупки. Каждый товар представлен в виде блока, содержащего поле
      ввода для изменения количества товара и отображение его цены. При
      изменении количества товаров в поле ввода, необходимо
      автоматически пересчитывать стоимость каждого товара и обновлять
      общую сумму покупки. </p>
    <SeminarTask2Component />

    <h3>Задание № 3</h3>
    <p>Вам необходимо создать компонент ипотечного калькулятора,
      который позволяет пользователю вводить сумму кредита,
      процентную ставку и срок кредита. Компонент должен автоматически
      вычислять ежемесячный платеж и общую сумму выплаты по кредиту.
    <ol>
      <li>Создайте компонент MortgageCalculator с соответствующим шаблоном и скриптом.</li>
      <li>В шаблоне компонента разместите поля ввода для суммы кредита, процентной
        ставки и срока кредита, а также элементы для отображения ежемесячного платежа
        и общей суммы выплаты.</li>
      <li>Используйте директиву v-model для связывания введенных пользователем
        значений с соответствующими свойствами в компоненте.</li>
      <li>Создайте вычисляемое свойство monthlyPayment, которое будет вычислять
        ежемесячный платеж на основе введенных значений суммы кредита, процентной
        ставки и срока кредита.</li>
      <li>Создайте вычисляемое свойство totalPayment, которое будет вычислять общую
        сумму выплаты по кредиту, учитывая ежемесячный платеж и срок кредита.</li>
      <li>Отобразите значения monthlyPayment и totalPayment в соответствующих элементах
        шаблона.</li>
    </ol>
    </p>
    <MortgageCalculator />

    <h3>Домашнее задание</h3>
    <p>Вы разрабатываете приложение для интернет-магазина и у вас есть компонент Vue под названием "ProductDetails".
      Компонент отображает детали о конкретном продукте, включая его название, цену и статус доступности.</p>

    <p>Внутри компонента "ProductDetails" создайте свойство "product" с объектом, представляющим информацию о продукте.
      Объект должен иметь свойства "name" (название продукта), "price" (цена продукта) и "available" (флаг, указывающий
      на доступность продукта).</p>

    <p>Используя вычисляемое свойство, назовите его "formattedPrice", которое будет возвращать форматированную цену
      продукта со знаком валюты. Например, если цена равна 99.99, вычисляемое свойство должно вернуть строку "$99.99".
    </p>

    <p>В компоненте "ProductDetails" отобразите название продукта, его форматированную цену и статус доступности.</p>

    <p>Если продукт доступен, отобразите текст "Available", в противном случае - "Out of stock".</p>

    <ProductDetails/>
  </div>
</template>

<script>
import SeminarTask1Component from '@/components/SeminarTask1Component.vue';
import SeminarTask2Component from '@/components/SeminarTask2Component.vue';
import MortgageCalculator from '@/components/MortgageCalculator.vue';
import ProductDetails from './components/ProductDetails.vue';

export default {
  name: 'App',
  components: {
    SeminarTask1Component,
    SeminarTask2Component,
    MortgageCalculator,
    ProductDetails
  }
}
</script>

<style>
#app {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  color: #2c3e50;
  margin-top: 60px;
}

h3 {
  color: blue;
}
</style>
